In [ ]:
#Merge

In [1]:
import pandas as pd
tabela_1 = pd.DataFrame({
'Nome':['João', 'João', 'Pedro' , 'Caio'], 
'Telefone': ['12121', '343434', '565656', '787878'], 
'Carros': ['azul', 'preto', 'verde' , 'amarelo']})

In [3]:
tabela_2 = pd.DataFrame({
'Nome':['João', 'Marcelo', 'Thiago' , 'Caio'],  
'Irmãos': ['1', '3', '2' , '2']})

how = ‘inner’

In [4]:
m = pd.merge(tabela_1, tabela_2, how = 'inner', on = 'Nome')

In [5]:
m

   Nome Telefone   Carros Irmãos
0  João    12121     azul      1
1  João   343434    preto      1
2  Caio   787878  amarelo      2

how = ‘outer’

In [6]:
m = pd.merge(tabela_1, tabela_2, how = 'outer')

In [7]:
m

      Nome Telefone   Carros Irmãos
0     João    12121     azul      1
1     João   343434    preto      1
2    Pedro   565656    verde    NaN
3     Caio   787878  amarelo      2
4  Marcelo      NaN      NaN      3
5   Thiago      NaN      NaN      2

how = ‘left’ ou how= ‘right’

In [8]:
## Obtém o mesmo resultado ##
m1 = pd.merge(tabela_1, tabela_2, how = 'left', on = 'Nome')
m2 = pd.merge(tabela_2, tabela_1, how = 'right', on = 'Nome')

In [10]:
m1

    Nome Telefone   Carros Irmãos
0   João    12121     azul      1
1   João   343434    preto      1
2  Pedro   565656    verde    NaN
3   Caio   787878  amarelo      2

In [9]:
m2

    Nome Irmãos Telefone   Carros
0   João      1    12121     azul
1   João      1   343434    preto
2  Pedro    NaN   565656    verde
3   Caio      2   787878  amarelo